AUTO_config_TK_pesok/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <comment>Заказ покупателя</comment>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>AccumulationRegister.ОбработкаЗаказовПоставщику</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПокупателей</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Поставщик/комитент от которого мы получили товар</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорВзаиморасчетов</name>
    <comment>Договор по которому ведутся взаиморасчеты с контрагентом</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <comment>Срок отгрузки товаров по заказу контрагенту</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегламентированныйУчет</name>
    <comment>Флаг отражения документа в регламентированном учете</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <comment>Адрес доставки для использования в печатных формах (оставлен для совместимости)</comment>
    <type>
      <types>CatalogRef.ТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксироватьЦены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПробивкаБезОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GuidСистемыСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКомментарий</name>
    <comment>Произвольный дополнительный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортативноеУстройствоВвода</name>
    <type>
      <types>CatalogRef.ПортативныеУстройстваВвода</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоРедактирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДДокументаОтгрузки</name>
    <comment>ID документа отгрузки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакОсновногоЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадкаПолучатель</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <comment>Сотрудник, заключивший сделку с контрагентом</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервироватьВОсновныхЕдиницах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Таблица товаров и услуг</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовое</name>
      <comment>Количество номенклатуры в базовых единицах (коэффициент=1)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНалогов</name>
      <comment>Цена без налогов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <comment>Итоговая сумма по строке документа со всеми налогами</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС по номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС по номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНалогов</name>
      <comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <comment>Процент скидки на продаваемый товар</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <comment>Сумма скидки по строке документа</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеЗаказовПоставщиков</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_ПараметрыОбменаEDI/ТК_ПараметрыОбменаEDI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_ПараметрыОбменаEDI</name>
  <resources>
    <name>УчетнаяЗаписьEDI</name>
    <type>
      <types>CatalogRef.ТК_УчетныеЗаписиEDI</types>
    </type>
  </resources>
  <resources>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИсходящаяРеализация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящееПоступлениеТоваров</name>
    <comment>Отправка приходов (COMDOC)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьЗаказИзПрихода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПротоколыЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящееПодтверждениеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПоИнвентаризации</name>
    <comment>INVRPT</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/AccumulationRegisters/РезервыТоваров/РезервыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТоваров</name>
  <resources>
    <name>Резерв</name>
    <comment>Количество зарезервированного товара на складе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <comment>Склад компании</comment>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <comment>Характеристика номенклатуры</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <comment>Документ оформления Резерва</comment>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/Documents/ЗаказПокупателя/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.ОтборХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("ЗаказПокупателя"));
	
		// СтандартныеПодсистемы.КонтрольВеденияУчета
	КонтрольВеденияУчета.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, "Список");
	// Конец СтандартныеПодсистемы.КонтрольВеденияУчета

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
		
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	ПериодВыборки = Неопределено;
	Если ПараметрыОтбора.Свойство("ПериодВыборки", ПериодВыборки) Тогда 
		
		ЭлементыОтбора = Список.Отбор.Элементы;
		
		ЭлементОтбораДанных = Неопределено;
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ЭлементОтбора.Представление = "ОтборПериод" Тогда
				ЭлементОтбораДанных = ЭлементОтбора;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ПериодВыборки) Тогда 
			
			Если ЭлементОтбораДанных = Неопределено Тогда
				ГруппаОтборПериод = ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтборПериод.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
				ГруппаОтборПериод.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
				ГруппаОтборПериод.Использование = Истина;
				ГруппаОтборПериод.Представление = "ОтборПериод";
			Иначе
				ГруппаОтборПериод = ЭлементОтбораДанных;
				ГруппаОтборПериод.Элементы.Очистить();
				ГруппаОтборПериод.Использование = Истина;
			КонецЕсли;	
			
			ГруппаДатаСортировки = ГруппаОтборПериод.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаДатаСортировки.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ; 
			ГруппаДатаСортировки.Использование = Истина;
			
			Если ЗначениеЗаполнено(ПериодВыборки.ДатаНачала) Тогда 
				ЭлементОтбораДанных = ГруппаДатаСортировки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
				ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				ЭлементОтбораДанных.ПравоеЗначение = ПериодВыборки.ДатаНачала;
				ЭлементОтбораДанных.Использование = Истина;
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(ПериодВыборки.ДатаОкончания) Тогда 
				ЭлементОтбораДанных = ГруппаДатаСортировки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
				ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				ЭлементОтбораДанных.ПравоеЗначение = ПериодВыборки.ДатаОкончания;
				ЭлементОтбораДанных.Использование = Истина;
			КонецЕсли;
			
			Если ГруппаДатаСортировки.Элементы.Количество() = 0 Тогда 
				ГруппаОтборПериод.Элементы.Удалить(ГруппаДатаСортировки);
			КонецЕсли;
			
		Иначе
			
			Если ЭлементОтбораДанных <> Неопределено Тогда
				ГруппаОтборПериод = ЭлементОтбораДанных;
				ГруппаОтборПериод.Элементы.Очистить();
				ГруппаОтборПериод.Использование = Ложь;
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Для Каждого текОтбор Из ПараметрыОтбора Цикл 		
		ИмяРеквизита = текОтбор.Ключ;
		Значение = текОтбор.Значение;
		
		Если текОтбор.Ключ = "ПериодВыборки" Тогда 
			Продолжить;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, 
			ИмяРеквизита, 
			Значение, 
			ВидСравненияКомпоновкиДанных.Равно,
			, 
			ЗначениеЗаполнено(Значение));
		
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура ПериодВыборкиПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("ПериодВыборки", ПериодВыборки));	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("Организация", ОтборОрганизация));	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеКомпанииПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("ПодразделениеКомпании", ОтборПодразделениеКомпании));	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("Контрагент", ОтборКонтрагент));	
КонецПроцедуры

&НаКлиенте
Процедура ОтборАвторПриИзменении(Элемент)
	УстановитьОтборСписка(Список, Новый Структура("Автор", ОтборАвтор));
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	тПериодВыборки 	= Настройки.Получить("ПериодВыборки");
	тОрганизация 	= Настройки.Получить("ОтборОрганизация");
	тПодразделение 	= Настройки.Получить("ОтборПодразделениеКомпании");
	тКонтрагент		= Настройки.Получить("ОтборКонтрагент");
	тАвтор			= Настройки.Получить("ОтборАвтор");
	
	СтруктураОтбора = Новый Структура;
	
	Если ЗначениеЗаполнено(тПериодВыборки) Тогда 
		СтруктураОтбора.Вставить("ПериодВыборки", тПериодВыборки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(тОрганизация) Тогда 
		СтруктураОтбора.Вставить("Организация", тОрганизация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(тПодразделение) Тогда 
		СтруктураОтбора.Вставить("ПодразделениеКомпании", тПодразделение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(тКонтрагент) Тогда 
		СтруктураОтбора.Вставить("Контрагент", тКонтрагент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(тАвтор) Тогда 
		СтруктураОтбора.Вставить("Автор", тАвтор);
	КонецЕсли;
	
	УстановитьОтборСписка(Список, СтруктураОтбора);
	
КонецПроцедуры


#КонецОбласти

// СтандартныеПодсистемы.КонтрольВеденияУчета

&НаКлиенте
Процедура Подключаемый_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтрольВеденияУчетаКлиент.ОткрытьОтчетПоПроблемамИзСписка(ЭтотОбъект, "Список", Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
		// СтандартныеПодсистемы.КонтрольВеденияУчета
	КонтрольВеденияУчета.ПриПолученииДанныхНаСервере(Настройки, Строки);
	// Конец СтандартныеПодсистемы.КонтрольВеденияУчета

КонецПроцедуры

&НаСервере
Процедура ЗарезервироватьНаСервере()
	
	ИспользоватьОбъединениеРезервированиеЗаказов = ПолучитьФункциональнуюОпцию("ИспользоватьОбъединениеРезервированиеЗаказов");
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьОбъединениеРезервированиеЗаказов Тогда
		РезервироватьМассивСписка(МассивСтрок);	
	Иначе
		для Каждого  СтрЗаказ Из МассивСтрок Цикл 
			РезервироватьСтрокуСписка(СтрЗаказ);	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Зарезервировать(Команда)
	ЗарезервироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура РезервироватьМассивСписка(МассивИзСписка)
	
	
	
	//// проверка на отгрузку
	//Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрокаСписка,?(ТК_СправочникиПовтИсп.ЭтоВнутреннийКонтрагент(СтрокаСписка.Контрагент),"ПеремещениеТоваров","РеализацияТоваров"));
	//Рез = Запрос.Выполнить();
	//
	//Если Не Рез.Пустой() Тогда
	//	Выборка = Рез.Выбрать();
	//	Выборка.Следующий();
	//	Если Выборка.Проведен Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка.СкладКомпании КАК СкладКомпании,
	|	ЕСТЬNULL(ДополнительныеСведения.Значение, ЛОЖЬ) КАК Попачка,
	|	ЗаказПокупателя.Ссылка.Контрагент КАК Контрагент,
	|	ЗаказПокупателя.Ссылка.ТочкаДоставки КАК ТочкаДоставки,
	|	ЗаказПокупателя.Ссылка КАК Заказ,
	|	НЕ ТК_ПараметрыОбменаEDI.Контрагент ЕСТЬ NULL КАК EDI
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО ЗаказПокупателя.Ссылка = ДополнительныеСведения.Объект
	|			И (ДополнительныеСведения.Свойство.Имя = ""Попачечно_b9a6d6a63dc74ae1a8f7d6a75ea25654"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТК_ПараметрыОбменаEDI КАК ТК_ПараметрыОбменаEDI
	|		ПО ЗаказПокупателя.Контрагент = ТК_ПараметрыОбменаEDI.Контрагент
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&Ссылка)
	|ИТОГИ ПО
	|	СкладКомпании,
	|	Попачка,
	|	Контрагент,
	|	ТочкаДоставки";
	
	Запрос.УстановитьПараметр("Ссылка", МассивИзСписка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//	РезультатЗапроса.Выгрузить()
	
	ВыборкаСкладКомпании = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСкладКомпании.Следующий() Цикл
		// Вставить обработку выборки ВыборкаСкладКомпании
		
		ВыборкаПопачка = ВыборкаСкладКомпании.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПопачка.Следующий() Цикл
			// Вставить обработку выборки ВыборкаПопачка
			
			ВыборкаКонтрагент = ВыборкаПопачка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКонтрагент.Следующий() Цикл
				// Вставить обработку выборки ВыборкаКонтрагент
				
				ВыборкаТочкаДоставки = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаТочкаДоставки.Следующий() Цикл
					// Вставить обработку выборки ВыборкаТочкаДоставки
					
					ПорцияЗаказов = Новый Массив;
					ВыборкаДетальныеЗаписи = ВыборкаТочкаДоставки.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
						Если ВыборкаДетальныеЗаписи.EDI Тогда
							СформироватьРезерв(ВыборкаДетальныеЗаписи.Заказ);
						Иначе
							ПорцияЗаказов.Добавить(ВыборкаДетальныеЗаписи.Заказ);
						КонецЕсли;
					КонецЦикла;
					
					Если ПорцияЗаказов.Количество() > 0 Тогда
						СформироватьРезерв(ПорцияЗаказов);
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РезервироватьСтрокуСписка(СтрокаСписка)
	
	
	
	// проверка на отгрузку
	Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрокаСписка,?(ТК_СправочникиПовтИсп.ЭтоВнутреннийКонтрагент(СтрокаСписка.Контрагент),"ПеремещениеТоваров","РеализацияТоваров"));
	Рез = Запрос.Выполнить();
	
	Если Не Рез.Пустой() Тогда
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		Если Выборка.Проведен Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	
	
	
	Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрокаСписка,"РезервированиеЗаказовПокупателя");
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		дОбъектРезерв = Документы.РезервированиеЗаказовПокупателя.СоздатьДокумент();
	Иначе
		ВыборкаРезерв = Рез.Выбрать();
		ВыборкаРезерв.Следующий();
		дОбъектРезерв = ВыборкаРезерв.ДокСсылка.ПолучитьОбъект();
		Если ВыборкаРезерв.Проведен Тогда
			дОбъектРезерв.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли ВыборкаРезерв.ПометкаУдаления Тогда
			дОбъектРезерв.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	дОбъектРезерв.Заполнить(СтрокаСписка);	
	дОбъектРезерв.Дата = ТекущаяДатаСеанса();
	Если дОбъектРезерв.ЭтоНовый() Тогда
		дОбъектРезерв.УстановитьНовыйНомер();
	КонецЕсли;
	
	
	ОбработкаТабличнойЧастиСервер.СортироватьТЧ(дОбъектРезерв.Товары);
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Склад",дОбъектРезерв.СкладКомпании);
	ЭлементБлокировки.ИсточникДанных  =  дОбъектРезерв.Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика","ХарактеристикаНоменклатуры");
	Блокировка.Заблокировать();
	
	Документы.РезервированиеЗаказовПокупателя.УдалитьСтрокиБезОстатка(дОбъектРезерв);
	Документы.РезервированиеЗаказовПокупателя.ОбработатьКвотируемыеПозиции(дОбъектРезерв);
	Документы.РезервированиеЗаказовПокупателя.ЗаполнитьХарактеристикиПоОстаткамПартий(дОбъектРезерв);
	//Проверим квоты после заполнения характеристик, может быть еще уменьшено кол-во
	Документы.РезервированиеЗаказовПокупателя.ОбработатьКвотируемыеПозиции(дОбъектРезерв);
	
	
	Если дОбъектРезерв.Товары.Количество() = 0 Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;		
	
	
	дОбъектРезерв.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный); 
	ОбщегоНазначения.СообщитьПользователю("Создан документ "+дОбъектРезерв.Ссылка);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьРезерв(Заказы)
	
	ОбъединениеРезервов = ТипЗнч(Заказы) = Тип("Массив");
	
	РезервыПорцииЗаказов = Новый Массив;
	
	Если ОбъединениеРезервов Тогда
		Для Каждого СтрЗаказ Из Заказы Цикл 
			Запрос = ЗапросНайтиПодчиненныйПоТипу(СтрЗаказ,"РезервированиеЗаказовПокупателя");
			Рез = Запрос.Выполнить();
			Если НЕ Рез.Пустой() Тогда
				ВыборкаРезерв = Рез.Выбрать();
				Пока ВыборкаРезерв.Следующий() Цикл
					РезервыПорцииЗаказов.Добавить(ВыборкаРезерв.ДокСсылка);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Запрос = ЗапросНайтиПодчиненныйПоТипу(Заказы,"РезервированиеЗаказовПокупателя");
		Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			ВыборкаРезерв = Рез.Выбрать();
			Пока ВыборкаРезерв.Следующий() Цикл
				РезервыПорцииЗаказов.Добавить(ВыборкаРезерв.ДокСсылка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	КоличествоРезервыПорцииЗаказов = РезервыПорцииЗаказов.Количество();
	Если КоличествоРезервыПорцииЗаказов = 0 Тогда
		дОбъектРезерв = Документы.РезервированиеЗаказовПокупателя.СоздатьДокумент();
	Иначе
		Для Индекс = 0 по РезервыПорцииЗаказов.ВГраница() Цикл 
			Если Индекс = РезервыПорцииЗаказов.ВГраница() Тогда
				дОбъектРезерв = РезервыПорцииЗаказов[Индекс].ПолучитьОбъект();
				Если дОбъектРезерв.Проведен Тогда
					дОбъектРезерв.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ИначеЕсли дОбъектРезерв.ПометкаУдаления Тогда
					дОбъектРезерв.УстановитьПометкуУдаления(Ложь);
				КонецЕсли;
			Иначе
				Если НЕ РезервыПорцииЗаказов[Индекс].ПометкаУдаления Тогда
					дОбъектРезерв = РезервыПорцииЗаказов[Индекс].ПолучитьОбъект();
					дОбъектРезерв.УстановитьПометкуУдаления(Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	дОбъектРезерв.Заполнить(Заказы);	
	дОбъектРезерв.Дата = ТекущаяДатаСеанса();
	Если дОбъектРезерв.ЭтоНовый() Тогда
		дОбъектРезерв.УстановитьНовыйНомер();
	КонецЕсли;
	
	ОбработкаТабличнойЧастиСервер.СортироватьТЧ(дОбъектРезерв.Товары);
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РезервыТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Склад",дОбъектРезерв.СкладКомпании);
	ЭлементБлокировки.ИсточникДанных  =  дОбъектРезерв.Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Характеристика","ХарактеристикаНоменклатуры");
	Блокировка.Заблокировать();
	
	Документы.РезервированиеЗаказовПокупателя.УдалитьСтрокиБезОстатка(дОбъектРезерв);
	Документы.РезервированиеЗаказовПокупателя.ОбработатьКвотируемыеПозиции(дОбъектРезерв);
	Документы.РезервированиеЗаказовПокупателя.ЗаполнитьХарактеристикиПоОстаткамПартий(дОбъектРезерв);
	//Проверим квоты после заполнения характеристик, может быть еще уменьшено кол-во
	Документы.РезервированиеЗаказовПокупателя.ОбработатьКвотируемыеПозиции(дОбъектРезерв);
	
	Если дОбъектРезерв.Товары.Количество() = 0 Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;		
	
	//тзЗаказыПокупателей = дОбъектРезерв.Товары.Выгрузить(,"ЗаказПокупателя");//.Скопировать(,"ЗаказПокупателя");
	//тзЗаказыПокупателей.Свернуть("ЗаказПокупателя");
	//Для Каждого СтрЗаказ Из тзЗаказыПокупателей Цикл
	//	стр = дОбъектРезерв.РаспределениеОтгрузки.Добавить();
	//	ЗаполнитьЗначенияСвойств(стр,СтрЗаказ);
	//КонецЦикла;
	
	дОбъектРезерв.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
	ОбщегоНазначения.СообщитьПользователю("Создан документ "+дОбъектРезерв.Ссылка);
	
	
	ЗафиксироватьТранзакцию();
	
	
	
	
	
КонецПроцедуры

&НаСервере
Функция ЗапросНайтиПодчиненныйПоТипу(Знач ДокСсылка,Знач ТипДокумента)
	Запрос = Новый Запрос;
	Запрос.Текст =     "ВЫБРАТЬ
	|	СвязанныеДокументы.Ссылка КАК ДокСсылка,
	|	ВЫБОР
	|		КОГДА СвязанныеДокументы.Ссылка ССЫЛКА Документ."+ТипДокумента+"
	|			ТОГДА ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ."+ТипДокумента+").ПометкаУдаления
	|	КОНЕЦ КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА СвязанныеДокументы.Ссылка ССЫЛКА Документ."+ТипДокумента+"
	|			ТОГДА ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ."+ТипДокумента+").Проведен
	|	КОНЕЦ КАК Проведен
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Док) КАК СвязанныеДокументы
	|ГДЕ
	|	СвязанныеДокументы.Ссылка ССЫЛКА Документ."+ТипДокумента+"";
	Запрос.УстановитьПараметр("Док",ДокСсылка);
	
	Возврат Запрос;
	
КонецФункции


// Конец СтандартныеПодсистемы.КонтрольВеденияУчета
